[
    {
      "bookId": 1,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/LtxMBvj/book1.jpg",
      "review": "A timeless classic that delves into the decadence and disillusionment of the American Dream.",
      "totalPages": 180,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Classic", "American Literature", "Romance"],
      "publisher": "Scribner",
      "yearOfPublishing": 1925
    },
    {
      "bookId": 2,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/6X6yrj4/book2.jpg",
      "review": "A timeless classic that delves into the decadence and disillusionment of the American Dream. Fitzgerald's prose paints a vivid picture of the Jazz Age, where opulence masks inner emptiness, and characters navigate a world of privilege and longing. Through the enigmatic Jay Gatsby, Fitzgerald explores themes of love, ambition, and the relentless pursuit of the elusive green light. The novel's tragic conclusion leaves readers pondering the fragility of human aspirations and the consequences of living in pursuit of an unattainable ideal.",
      "totalPages": 281,
      "rating": 4.8,
      "category": "Fiction",
      "tags": ["Classic", "Legal Drama", "Social Issues"],
      "publisher": "J.B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "bookId": 3,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "https://i.ibb.co/rGVGgmC/book3.jpg",
      "review": "A powerful portrayal of racial injustice and moral growth in a small Southern town. Through the eyes of young Scout Finch, Lee masterfully captures the complexities of race, class, and morality in the 1930s Deep South. The trial of Tom Robinson serves as a focal point, revealing the pervasive prejudice that divides the community. Yet, amidst the darkness, there are moments of compassion and integrity, embodied by the noble Atticus Finch. Lee's poignant narrative resonates with timeless truths about empathy, courage, and the enduring struggle for justice.",
      "totalPages": 328,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Dystopian", "Political", "Social Commentary"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookId": 4,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/PwSq1FY/book4.jpg",
      "review": "An iconic coming-of-age novel that captures the angst and alienation of adolescence. Salinger's protagonist, Holden Caulfield, navigates the complexities of teenage identity against the backdrop of post-war America. Through Holden's cynical yet vulnerable voice, Salinger explores themes of authenticity, belonging, and the loss of innocence. As Holden embarks on a journey of self-discovery through the streets of New York City, readers are drawn into his world of disillusionment and yearning for connection. Salinger's masterful storytelling continues to resonate with readers of all generations, reminding us of the universal struggle to find meaning in a world that often seems indifferent.",
      "totalPages": 224,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["Coming-of-Age", "Literary Fiction", "Rebellion"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "bookId": 5,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/k15CDwL/book5.jpg",
      "review": "A witty and romantic comedy of manners set in early 19th-century England. Austen's novel follows the spirited Elizabeth Bennet as she navigates the intricacies of love, social status, and family expectations. Through sparkling dialogue and astute observation, Austen satirizes the conventions of her time while celebrating the triumph of true love over societal prejudice. The dynamic relationship between Elizabeth and the enigmatic Mr. Darcy unfolds against a backdrop of balls, gossip, and matchmaking, culminating in a satisfying conclusion that reaffirms the enduring appeal of Austen's wit and wisdom.",
      "totalPages": 432,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Romance", "Classic", "British Literature"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
    },
    {
      "bookId": 6,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/jfhRX4W/book6.jpg",
      "review": "An enchanting adventure tale set in the fantastical world of Middle-earth. Tolkien's timeless classic follows the reluctant hero Bilbo Baggins as he embarks on a quest to reclaim a lost treasure guarded by the fearsome dragon, Smaug. Along the way, Bilbo encounters elves, dwarves, and other mythical creatures, facing challenges that test his courage and resourcefulness. Tolkien's richly imagined world, complete with detailed maps, languages, and histories, captivates readers of all ages, transporting them to a realm of magic and wonder. Through Bilbo's journey of self-discovery, Tolkien imparts timeless lessons about bravery, friendship, and the power of ordinary individuals to shape the course of destiny.",
      "totalPages": 310,
      "rating": 4.9,
      "category": "Fiction",
      "tags": ["Fantasy", "Adventure", "Epic"],
      "publisher": "Allen & Unwin",
      "yearOfPublishing": 1937
    },
    {
        "bookId": 7,
        "bookName": "The Road",
        "author": "Cormac McCarthy",
        "image": "https://i.ibb.co/YQ6wPm7/book7.jpg",
        "review": "A haunting post-apocalyptic tale of survival and the bond between a father and son. McCarthy's spare yet evocative prose paints a bleak landscape ravaged by an unspecified catastrophe, where survival is a daily struggle against hunger, cold, and marauding gangs. Amidst this desolation, a father and his young son journey towards the coast in search of hope and sanctuary. Their bond, forged in the crucible of adversity, becomes a beacon of light in a world consumed by darkness. McCarthy's unflinching exploration of love, sacrifice, and the human spirit leaves a lasting impression, reminding readers of the resilience of the human heart in the face of unimaginable despair.",
        "totalPages": 287,
        "rating": 4.4,
        "category": "Fiction",
        "tags": ["Dystopian", "Survival", "Literary Fiction"],
        "publisher": "Alfred A. Knopf",
        "yearOfPublishing": 2006
      },
      {
        "bookId": 8,
        "bookName": "Harry Potter and the Philosopher's Stone",
        "author": "J.K. Rowling",
        "image": "https://i.ibb.co/tQnHGd6/book8.jpg",
        "review": "An enchanting start to the beloved Harry Potter series, full of magic, friendship, and adventure. Rowling's debut novel introduces readers to the world of Hogwarts School of Witchcraft and Wizardry, where young Harry Potter discovers his true identity as a wizard and embarks on a journey of self-discovery. Alongside his loyal friends Ron and Hermione, Harry navigates the challenges of school life while uncovering the dark secrets of his past. Rowling's imaginative world-building and engaging storytelling captivate readers of all ages, inviting them into a universe where the ordinary and the extraordinary coexist in delightful harmony. As Harry's journey unfolds, readers are swept away on a magical adventure filled with wonder, danger, and the power of love.",
        "totalPages": 309,
        "rating": 4.7,
        "category": "Fantasy",
        "tags": ["Wizardry", "Magic", "Young Adult"],
        "publisher": "Bloomsbury Publishing",
        "yearOfPublishing": 1997
      },
      {
        "bookId": 9,
        "bookName": "The Hunger Games",
        "author": "Suzanne Collins",
        "image": "https://i.ibb.co/YThCMNW/book9.jpg",
        "review": "A gripping dystopian novel that follows the story of Katniss Everdeen in a brutal fight for survival. Set in a future society where children are forced to compete in a televised death match, Collins' novel explores themes of oppression, resistance, and the human instinct for survival. Through Katniss' eyes, readers witness the horrors of the Hunger Games and the resilience of the human spirit in the face of injustice. As Katniss defies the Capitol and becomes a symbol of rebellion, Collins raises profound questions about the nature of power, sacrifice, and the ethics of entertainment.",
        "totalPages": 374,
        "rating": 4.5,
        "category": "Science Fiction",
        "tags": ["Dystopian", "Survival", "Young Adult"],
        "publisher": "Scholastic Corporation",
        "yearOfPublishing": 2008
      }
  ]
  